<template>
  <section class="hero">
    <div class="hero-body container">
      <div class="section is-fullhd">
        <div class="content">
          <h1>Пару слов о моём опыте (и котах)</h1>
          
          <p>Интерес к программированию мне привил мой троюродный брат - очень крутой человек. 
            Он изучал астрофизику в МГУ, обожал математику и удаленно работал в качестве Problem Solver в немецкой компании. <br>А ещё любил писать мне задачи для решения на листе и очень терпеливо ждал и наблюдал как я вытаюсь что-то родить в ответе.</p>
          <h3>Школа</h3>
          <p>Самостоятельно изучать программирование я начала ещё в школьные годы, но успехи мои были невелики. Интернет даёт слишком много знаний за раз, если ты не умеешь формулировать свои вопросы чётко и правильно. Прочитала несколько книг, в том числе и Head First Java</p>
          <h3>Университет</h3>
          Поступив в Киевский национальный университет имени Бориса Гринченко на направление информатика, я начала изучать программирование не в разнобой, а по порядку. Была отличницей.<br>
          <br>Изучала:
          <ul>
            <li v-for="(ability, index) in abilities" :key="index">{{ability}}</li>
          </ul>
          <p>Из-за определённых обстоятельств, я проучилась всего 2 курса и переехала в РФ.</p>     
          
          <h3>Свободное плавание</h3>
          <p>Самостоятельно допроходила курсы JavaGR8, но чем лучше я знала этот язык, тем меньше он мне нравился. Не найдя в своих задумках ему достойного применения, переключилась на веб-разработку. </p>
          <figure class="image is-128x128"><img class="is-rounded" src="https://pp.userapi.com/c845021/v845021204/f4f6a/3lnRMcrA5Vs.jpg"><figcaption>
            Моя кошка
          </figcaption>
          <img class="is-rounded" src="https://pp.userapi.com/c848532/v848532204/7d91d/hTXEAyoWX88.jpg"><figcaption>
            Мой кот
          </figcaption></figure>
        </div>
      </div>
    </div>
  </section>
</template>
<script>
export default {
  name: 'experience',
  data (){
    return {
      abilities: [
        'Построение алгоритмов и блок-схем',
        'Алгоритмы и структуры данных',
        'Pascal, Delphi, ООП, C#, C++, Java',
        'Математическую логику',
        'Высшую математику',
        'И ещё много чего'
      ]
    }
  }
}
</script>

<style>
</style>
